socialNetwork/wrk2/user-timeline-without-istio/COMMAND_35/105
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  8 threads and 32 connections
  Thread calibration: mean lat.: 3696.371ms, rate sampling interval: 12976ms
  Thread calibration: mean lat.: 3717.002ms, rate sampling interval: 13189ms
  Thread calibration: mean lat.: 3722.692ms, rate sampling interval: 13197ms
  Thread calibration: mean lat.: 3802.859ms, rate sampling interval: 13336ms
  Thread calibration: mean lat.: 3834.997ms, rate sampling interval: 13320ms
  Thread calibration: mean lat.: 3740.211ms, rate sampling interval: 12992ms
  Thread calibration: mean lat.: 3630.362ms, rate sampling interval: 13017ms
  Thread calibration: mean lat.: 3682.081ms, rate sampling interval: 12976ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    27.13s     8.14s   37.88s    72.37%
    Req/Sec    21.33      0.99    23.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   29.18s 
 75.000%   34.31s 
 90.000%   35.39s 
 99.000%   37.88s 
 99.900%   39.91s 
 99.990%   40.14s 
 99.999%   40.30s 
100.000%   40.30s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8962.047     0.000000            2         1.00
   13475.839     0.100000          909         1.11
   19382.271     0.200000         1810         1.25
   22183.935     0.300000         2718         1.43
   26345.471     0.400000         3623         1.67
   29179.903     0.500000         4517         2.00
   31260.671     0.550000         4979         2.22
   31703.039     0.600000         5435         2.50
   33456.127     0.650000         5877         2.86
   34013.183     0.700000         6337         3.33
   34308.095     0.750000         6829         4.00
   34406.399     0.775000         7045         4.44
   34537.471     0.800000         7274         5.00
   34668.543     0.825000         7499         5.71
   34799.615     0.850000         7699         6.67
   34996.223     0.875000         7914         8.00
   35127.295     0.887500         8024         8.89
   35389.439     0.900000         8138        10.00
   35880.959     0.912500         8246        11.43
   36175.871     0.925000         8360        13.33
   36503.551     0.937500         8479        16.00
   36634.623     0.943750         8533        17.78
   36798.463     0.950000         8594        20.00
   36929.535     0.956250         8641        22.86
   37158.911     0.962500         8711        26.67
   37289.983     0.968750         8753        32.00
   37388.287     0.971875         8790        35.56
   37453.823     0.975000         8814        40.00
   37552.127     0.978125         8846        45.71
   37650.431     0.981250         8876        53.33
   37715.967     0.984375         8898        64.00
   37748.735     0.985938         8909        71.11
   37781.503     0.987500         8923        80.00
   37847.039     0.989062         8939        91.43
   37912.575     0.990625         8951       106.67
   37978.111     0.992188         8968       128.00
   38010.879     0.992969         8973       142.22
   38076.415     0.993750         8981       160.00
   38141.951     0.994531         8985       182.86
   38207.487     0.995313         8993       213.33
   38273.023     0.996094         9004       256.00
   38273.023     0.996484         9004       284.44
   38338.559     0.996875         9006       320.00
   38502.399     0.997266         9010       365.71
   38535.167     0.997656         9013       426.67
   39583.743     0.998047         9017       512.00
   39649.279     0.998242         9019       568.89
   39682.047     0.998437         9020       640.00
   39747.583     0.998633         9022       731.43
   39845.887     0.998828         9024       853.33
   39976.959     0.999023         9026      1024.00
   40042.495     0.999121         9028      1137.78
   40042.495     0.999219         9028      1280.00
   40042.495     0.999316         9028      1462.86
   40108.031     0.999414         9030      1706.67
   40108.031     0.999512         9030      2048.00
   40140.799     0.999561         9033      2275.56
   40140.799     0.999609         9033      2560.00
   40140.799     0.999658         9033      2925.71
   40140.799     0.999707         9033      3413.33
   40140.799     0.999756         9033      4096.00
   40140.799     0.999780         9033      4551.11
   40140.799     0.999805         9033      5120.00
   40140.799     0.999829         9033      5851.43
   40140.799     0.999854         9033      6826.67
   40140.799     0.999878         9033      8192.00
   40304.639     0.999890         9034      9102.22
   40304.639     1.000000         9034          inf
#[Mean    =    27131.394, StdDeviation   =     8140.940]
#[Max     =    40271.872, Total count    =         9034]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12033 requests in 1.00m, 2.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 421
Requests/sec:    200.48
Transfer/sec:     42.09KB